console.log('お゛は゛よ゛う゛さ゛ん゛')

// const class_info = document.getElementById('class_info')
// const student_info = document.getElementById('student_info')

// console.log(class_info)
// console.log(student_info)

THRESHOLD = 2025

const class_info = [
  { '科目番号': 6501102, '学籍番号': 202710025 },
  { '科目番号': 6501102, '学籍番号': 202710054 },
  { '科目番号': 6501102, '学籍番号': 202710015 },
  { '科目番号': 6501102, '学籍番号': 202710010 },
  { '科目番号': 6501102, '学籍番号': 202713003 },
  { '科目番号': 6501102, '学籍番号': 202713055 },
  { '科目番号': 6501102, '学籍番号': 202713036 },
  { '科目番号': 6501102, '学籍番号': 202610000 },
  { '科目番号': 6501102, '学籍番号': 202610024 },
  { '科目番号': 6501102, '学籍番号': 202610029 },
  { '科目番号': 6501102, '学籍番号': 202613097 },
  { '科目番号': 6501102, '学籍番号': 202613081 },
  { '科目番号': 6501102, '学籍番号': 202110098 },
  { '科目番号': 6501102, '学籍番号': 202510049 },
  { '科目番号': 6501102, '学籍番号': 202513059 }
];

const student_info = [
    { '学籍番号': 202710025, '入学年度': 2027, '入学年次': 1 },
    { '学籍番号': 202710054, '入学年度': 2027, '入学年次': 1 },
    { '学籍番号': 202710015, '入学年度': 2027, '入学年次': 1 },
    { '学籍番号': 202710010, '入学年度': 2027, '入学年次': 1 },
    { '学籍番号': 202713003, '入学年度': 2027, '入学年次': 3 },
    { '学籍番号': 202713055, '入学年度': 2027, '入学年次': 3 },
    { '学籍番号': 202713036, '入学年度': 2027, '入学年次': 3 },
    { '学籍番号': 202610000, '入学年度': 2026, '入学年次': 1 },
    { '学籍番号': 202610024, '入学年度': 2026, '入学年次': 1 },
    { '学籍番号': 202610029, '入学年度': 2026, '入学年次': 1 },
    { '学籍番号': 202613097, '入学年度': 2026, '入学年次': 3 },
    { '学籍番号': 202613081, '入学年度': 2026, '入学年次': 3 },
    { '学籍番号': 202110098, '入学年度': 2021, '入学年次': 1 },
    { '学籍番号': 202510049, '入学年度': 2025, '入学年次': 1 },
    { '学籍番号': 202513059, '入学年度': 2025, '入学年次': 3 }
];
  
const num_class = class_info[0]['科目番号']

const students_u2025 = []

for (let c_info of class_info) {
  let num_student = 0;
  for (let s_info of student_info ) {
    if (c_info['学籍番号'] == s_info['学籍番号']) {
      num_student = s_info['学籍番号'];
      year_applied = s_info['入学年度'] - s_info['入学年次']
      if (year_applied < THRESHOLD) {
        students_u2025.push(s_info['学籍番号'])
      }
      break;
    }
  }
  if (num_student == 0) {
    console.log(`${c_info['学籍番号']} is NOT included in students list.`)
  }
}

console.log(students_u2025)

